rescue-mission/app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
    @answer = Answer.new
    @answers = Answer.where(question_id: params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" IS NULL LIMIT 1

  def update
    @question = Question.find(params[:id])
    @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "meep? Question Goes Here at least 40 characters!!!"], ["updated_at", "2015-03-26 20:21:49.590151"], ["id", 1]]

  def destroy
    @question = Question.find(params[:id])
    @answers = Answer.where(question_id: params[:id])
    if @question.destroy
      @answers.each do |answer|
        answer.destroy
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 5]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 14]]