rescue-mission/app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
    @answer = Answer.new
    @answers = Answer.where(question_id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 29]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 14]]

  def create
    @question = Question.create(question_params)
---
INSERT INTO "questions" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    @question = Question.find(params[:id])
    @answers = Answer.where(question_id: params[:id])
    if @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 526]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 526]]