launchtails-nested-routes/app/views/drinks/new.html.erb

      <%= f.label :category_id %>
      <%= f.select :category_id, Category.all.map { |c| [c.name, c.id] } %>
---
SELECT "categories".* FROM "categories"