car-listings/app/controllers/cars_controller.rb

  def index
    @cars = Car.order("year DESC").page(params[:page])
---
SELECT  "cars".* FROM "cars"  ORDER BY year DESC LIMIT 25 OFFSET 0

  def new
    @car = Car.new
    @manufacturers = Manufacturer.all
---
SELECT "manufacturers".* FROM "manufacturers"

  def create
    @manufacturers = Manufacturer.all
    @manufacturer = Manufacturer.find(params[:car][:manufacturer_id])
    @car = Car.new(car_params)
    if @car.save
---
SELECT  "manufacturers".* FROM "manufacturers"  ORDER BY "manufacturers"."id" ASC LIMIT 1
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 125]]
SELECT "cars".* FROM "cars" WHERE "cars"."manufacturer_id" = $1  [["manufacturer_id", 1]]
INSERT INTO "cars" ("model", "color", "year", "mileage", "description", "manufacturer_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["model", "Veloster"], ["color", "Red"], ["year", 2012], ["mileage", 35000], ["description", ""], ["manufacturer_id", 165]]