car-listings/app/controllers/manufacturers_controller.rb

SELECT  "manufacturers".* FROM "manufacturers"  ORDER BY name ASC LIMIT 25 OFFSET 0
---
  def index
    @manufacturers = Manufacturer.order("name ASC").page(params[:page])

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 9]]
---
  def show
    @manufacturer = Manufacturer.find(params[:id])

INSERT INTO "manufacturers" ("name", "country") VALUES ($1, $2) RETURNING "id"  [["name", "Hyundai"], ["country", "South Korea"]]
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save