launchtails-nested-routes/app/views/categories/show.html.erb

SELECT "drinks".* FROM "drinks" WHERE "drinks"."category_id" = $1  [["category_id", 1]]
---
<ul>
  <% @category.drinks.each do |drink| %>