launchtails-nested-routes/app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @category = Category.find(params[:category_id])